#frontend არის ვებსაიტის აგება, ანუ რასაც ვხედავთ გაკეკანზე
#backend ინახავს ინფორმაციას რომელიც ვებსაიტზე გვჭირდება 
#fullstack ფრონტრნდი და ბაქენდი გაერთიანებული

#front end-ის 3 ძირითადი ნაწილია HTML, CSS, JavaScript
#ამ სამივეს ვიყენებთ ერთად ვებ გვერდის შესაქმნელად

#HTML-ს ელემენტები: სათაური, პარაგრაფი, სურათი

#თეგები არის ნიშანი რომელიც ელენმენტის შესაქმნელად გამოიყენება
#გამხსნელი თეგი იწყებს ელემენტს, ხოლო დამხურავი თეგი ასრულებს

#კონტეინერ თეგი არის თეგი რომელიც სხვა ელემენტებს შეიცავს 
#ცარიელი თეგი არის თეგი რომელსაც არ აქვს დახურვის თგი და შიგთავსი

#abbr არის ელემენტი რომელიც აბრევიატურების დასადგენად გამოიყენება
#იგი კონტეინერ ელემენტია
#(ინფორმაცია w3schools)
