#ციკლი არის კოდის გამეორების მექანიზმი
#ხოლო იტერაცია ციკლის თითოეული შესრულებაა

#For - არის დამხმარე სიტყვა და მისი დახმარებით იქმნება loop
# i არის საიტერაციო ხვლადი და არის იტერაციის პირველი ასო, ისე ნებისმიერი რამე შეიძლება იყოს
#range() ვავლებთ დიაპაზონს

for i in range (20, 50):
    print(i) 

for i in range (20, 51, 2):
    print(i)

for i in range (11, 32, 2):
    print(i)

for i in range (10):
    print("ნატალი ბაჯელიძე")

for i in range (10, 31, 2):
    print(i)

for i in range (40, 61):
    print(i**3) 