#პირობითი ნაწილი დაიყოფა 6 ნაწილად

#რიცხვითი: გვხვდება როდესაც საჭიროა რიცხვები, გვჭირდება გამოთვლებში
#სტრიქონი: როდესაც საწიროა ტექსტი, ტექსტში
#ლოგიკური: როდესაც საწიროა true/false, პირობებში
#კოლექციები: როდესაც საჭიროა მონაცემების ჯგუფში, მონაცემთა ჯგუფში
#ბინარული: როდესაც საჭიროა მონაცემების ჯგუფი, ბინადირულ მონაცემებში
#ცარიელი: როდესაც საჭიროა none მნიშვნელობა, არსებობაში

# / და % შორის განსხვავება

# / აჩვენებს სრულ გაყოფის შედეგს
# % აჩვენებს გაყოფის ნაშთს

a = 5 + 3 # შედეგი 8
b = -7 # შედეგი -7
a = 4 * 3 # შედეგი 12
a = 10 / 2 # შედეგი 5.0
a + 10 % 3 # შედეგი 1
a = 2 ** 3 # შედეგი 8